---
kind: method
id: M:Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent.Reset
source: html/c81f2df9-fa8e-8bac-2647-9c45e331d580.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent.Reset Method

Clears KeyBasedTreeEntriesLoadContent object, including KeyBasedTreeEntries and KeyBasedTreeEntriesLoadResults, owned by this KeyBasedTreeEntriesLoadContent object.

## Syntax (C#)
```csharp
public void Reset()
```

## Remarks
This method can be used to clear all data that has been added to this KeyBasedTreeEntriesLoadContent object to date
 so that the caller can start adding and building KeyBasedTreeEntries again.